tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"
brew "apprise"
brew "ast-grep"
brew "berkeley-db@4"
brew "bitcoin"
brew "chezmoi"
brew "cloudflared"
brew "direnv"
brew "harfbuzz"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gh"
brew "jj"
brew "jq"
brew "lua"
brew "luarocks"
brew "nvm"
brew "picotool"
brew "poppler"
brew "powerlevel10k"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qt@5"
brew "pyqt@5"
brew "python@3.11"
brew "qt"
brew "ripgrep"
brew "rust-analyzer"
brew "rustup"
brew "scipy"
brew "sesh"
brew "socat"
brew "starship"
brew "tailscale"
brew "telnet"
brew "tmux"
brew "todoist-cli"
brew "uv"
brew "zig"
brew "zoxide"
cask "aerospace"
cask "alacritty"
cask "balenaetcher"
cask "deskpad"
cask "font-hack-nerd-font"
cask "fontforge-app"
cask "karabiner-elements"
cask "libreoffice"
cask "love"
cask "ngrok"
cask "orbstack"
cask "protonvpn"
cask "raspberry-pi-imager"
cask "sequel-ace"
cask "todoist-app"
vscode "alexcvzz.vscode-sqlite"
vscode "anthropic.claude-code"
vscode "arrterian.nix-env-selector"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "factory.factory-vscode-extension"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "jakebecker.elixir-ls"
vscode "jnoortheen.nix-ide"
vscode "k--kato.intellij-idea-keybindings"
vscode "mechatroner.rainbow-csv"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-speech"
vscode "openai.chatgpt"
vscode "phoenixframework.phoenix"
vscode "pinage404.nix-extension-pack"
vscode "platformio.platformio-ide"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sorbet.sorbet-vscode-extension"
vscode "tamasfe.even-better-toml"
vscode "twxs.cmake"
vscode "vue.volar"
vscode "ziglang.vscode-zig"
vscode "zxh404.vscode-proto3"
go "golang.org/x/tools/gopls"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/wailsapp/wails/v2/cmd/wails"
go "github.com/wailsapp/wails/v3/cmd/wails3"
